### Fetch the datasets

In [1]:
import pandas as pd

df = pd.read_csv("clean_coffee_shop_sales.csv")
df_monthly = pd.read_csv("monthly_sales_summary.csv")

In [2]:
df_monthly.head()

,Unnamed: 0,transaction_month,total_sales,sales_difference,sales_percent_change
0,0,1,81677.74,NaN,NaN
1,1,2,76145.19,-5532.55,-6.773633
2,2,3,98834.68,22689.49,29.797667
3,3,4,118941.08,20106.40,20.343466
4,4,5,156727.76,37786.68,31.769242

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 13 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         149116 non-null  int64
 1   transaction_id     149116 non-null  int64
 2   transaction_date   149116 non-null  object
 3   transaction_time   149116 non-null  object
 4   transaction_qty    149116 non-null  int64
 5   store_id           149116 non-null  int64
 6   store_location     149116 non-null  object
 7   product_id         149116 non-null  int64
 8   unit_price         149116 non-null  float64
 9   product_category   149116 non-null  object
 10  product_type       149116 non-null  object
 11  product_detail     149116 non-null  object
 12  transaction_month  149116 non-null  int64
dtypes: float64(1), int64(6), object(6)
memory usage: 14.8+ MB

### Calculate the total number of orders for each respective month.

In [4]:
df['transaction_id'].max()

149456

In [5]:
df.tail()

,Unnamed: 0,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail,transaction_month
149111,149111,149452,2023-06-30,20:18:41,2,8,Hell's Kitchen,44,2.50,Tea,Brewed herbal tea,Peppermint Rg,6
149112,149112,149453,2023-06-30,20:25:10,2,8,Hell's Kitchen,49,3.00,Tea,Brewed Black tea,English Breakfast Lg,6
149113,149113,149454,2023-06-30,20:31:34,1,8,Hell's Kitchen,45,3.00,Tea,Brewed herbal tea,Peppermint Lg,6
149114,149114,149455,2023-06-30,20:57:19,1,8,Hell's Kitchen,40,3.75,Coffee,Barista Espresso,Cappuccino,6
149115,149115,149456,2023-06-30,20:57:19,2,8,Hell's Kitchen,64,0.80,Flavours,Regular syrup,Hazelnut syrup,6

### Export Monthly File

In [6]:
# df.to_csv("monthly_sales_summary.csv")